Управление_гостиницами_EDT/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <comment>Справочник гостей бронирующих и проживающих</comment>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_гостиницами_EDT/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <comment>Регистр для хранения контактной информации</comment>
  <resources>
    <name>НомерПриведенный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерСохраненный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DefinedType.ВладельцыТелефонов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_гостиницами_EDT/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Управление_гостиницами_EDT/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <comment>Адрес постоянного места жительства</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_гостиницами_EDT/src/Catalogs/Клиенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем ВыполняемЗапись;
#Область ПроцедурыОповещений

&НаКлиенте
Процедура ПослеВопросаОСозданииФизЛица(Результат,ДопПараметры) Экспорт
	Если Результат = "СоздатьНововго" Тогда
		
	ИначеЕсли Результат = "Выбрать" Тогда
		
	Иначе //если результат = "Продолжить" - Выбрать позже
		
		ВыполняемЗапись = Истина;
		ЭтаФорма.Записать();
	
	КонецЕсли;

КонецПроцедуры

	 
#КонецОбласти


#Область ЗаписьЭлемента
//Функции и процедуры обработки событий перед и при записи
&НаСервере
Процедура ОбновитьИЗаписатьРеквизитыПередЗаписьюСервер()

	ПродолжитьЗапись = ИСТИНА;
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо  Тогда
		Объект.Наименование = Объект.ФизическоеЛицо.Наименование;
	КонецЕсли; 
	ЗаполнитьРеквизитыКО();
КонецПроцедуры // ОбновитьИЗаписатьРеквизитыПередЗаписьюСервер()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Если ВыполняемЗапись = Неопределено Тогда //Выполняется запись и требуется проверка	
	//	Если СокрЛП(Объект.ЮридическоеФизическоеЛицо) = "Физическое лицо" Тогда
	//		Если НЕ ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
	//			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСозданииФизЛица",ЭтаФорма);
	//			Кнопки = Новый СписокЗначений();
	//			Кнопки.Добавить("СоздатьНового", "Создать нового");
	//			Кнопки.Добавить("Выбрать", "Выбрать существующего");
	//			Кнопки.Добавить("Продолжить", "Выбрать позже");
	//			ПоказатьВопрос(ОписаниеОповещения,"Вы не указали физическое лицо для этого клиента",Кнопки,,"Выбрать","Внимание!");
	//			Отказ = Истина;
	//			ВыполняемЗапись = Ложь;
	//		Иначе
	//			ВыполняемЗапись = Истина;	
	//		КонецЕсли; 
	//		
	//	КонецЕсли; 
	//ИначеЕсли ВыполняемЗапись = Ложь Тогда
	//	Отказ = Истина;
	//Иначе
	//	ОбновитьИЗаписатьРеквизитыПередЗаписьюСервер();	
	//	
	//КонецЕсли; 
	ОбновитьИЗаписатьРеквизитыПередЗаписьюСервер();
КонецПроцедуры

#КонецОбласти 

Процедура ЗаполнитьРеквизитыКО()

	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ВладелецКО = Объект.ФизическоеЛицо;
	Иначе	
		ВладелецКО = Объект.Ссылка;
	
	КонецЕсли; 
	
	КонтактнаяИнформация = РаботаСКонтактнойИнформациейВызовСервера.ПолучитьЗначенияКО(ВладелецКО);
	КонтактнаяИнформация.Свойство("Телефон",Телефон);
	КонтактнаяИнформация.Свойство("ЭлетроннаяПочта",ЭлектроннаяПочта);

КонецПроцедуры


Процедура ОбновитьРеквизиты()

	

КонецПроцедуры


#Область ОбработчикиОповещений

&НаКлиенте
Процедура ПослеЗакрытияФормыФизЛица(Результат,ДопПараметры)  Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Если НЕ Результат.Пустая() Тогда
			Объект.ФизическоеЛицо = Результат;
			ОбновитьИЗаписатьРеквизитыПередЗаписьюСервер();
			Записать();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
	
#КонецОбласти


&НаСервере
Функция ИмяСсылкиПеречисления(Ссылка)

	Возврат ОбщегоНазначения.ИмяСсылкиПеречисления(Ссылка);

КонецФункции // ИмяПеречисления()

&НаСервере
Процедура ЗаполнитьЗначенияСервер(Приемник,Источник,Свойства = Неопределено,Исключая = Неопределено)
	Если ТипЗНЧ(Приемник) = Тип("Строка") Тогда
		РФЗначение = РеквизитФормыВЗНачение(Приемник);		
		ЗаполнитьЗначенияСвойств(РФЗначение,Источник,Свойства,Исключая);
		ЗначениеВРеквизитФормы(РФЗначение,Приемник);
	Иначе
		
		ЗаполнитьЗначенияСвойств(Приемник,Источник,Свойства,Исключая);	
	
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПереключитьСТраницы()

	Элементы.грСтрЮрФизЛица.ТекущаяСтраница = Элементы["Стр" + ИмяСсылкиПеречисления(Объект.ЮридическоеФизическоеЛицо)];
	//Если Объект.ЮридическоеФизическоеЛицо = Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо "ЮрЛицо" Тогда
	//    Элементы.грСтрЮрФизЛица.ТекущаяСтраница = Элементы.СтрЮридическоеЛицо;
	//Иначе
	//	Элементы.грСтрЮрФизЛица.ТекущаяСтраница = Элементы.СтрФизическоеЛицо;
	//КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностью()
	

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()

	Элементы.ФизическоеЛицо.Видимость = ЗначениеЗаполнено(Объект.ФизическоеЛицо);	

КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияРеквизитовФормы()
	Если ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
	
		Элементы.ВыбратьФизЛицо.Заголовок = "Изменить";	
	
	КонецЕсли; 
	ПереключитьСтраницы();
	УправлениеДоступностью();
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Функция ИмяСсылкиПеречисленияСервер(СсылкаПеречисления)
	
	Возврат ОбщегоНазначения.ИмяСсылкиПеречисления(СсылкаПеречисления);

КонецФункции

&НаКлиенте
Процедура НачатьОткрытиеФормыФизЛица()
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыФизЛица",ЭтаФорма);
	
	ПараметрыФормы = Новый Структура("ЗакрыватьСПараметрами", Истина);
	Если Объект.Ссылка.Пустая() Тогда
		Форма = ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта",ПараметрыФормы ,ЭтаФорма.ВладелецФормы,ЭтаФорма,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		ДанныеФормы = Форма.Объект;
		КопироватьДанныеФормы(ДанныеФормы,Форма.Объект);
	Иначе
	    ПараметрыФормы.Вставить("Ключ",Объект.ФизическоеЛицо);
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта",ПараметрыФормы,ЭтаФорма.ВладелецФормы,ЭтаФорма,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ИмяСсылкиПеречисленияСервер(Объект.ЮридическоеФизическоеЛицо) = "ФизическоеЛицо" Тогда
		Отказ = Истина;
		НачатьОткрытиеФормыФизЛица();
	Иначе
		ИнициализацияРеквизитовФормы();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеСвойства = "";
	
	Если ЭтаФорма.Параметры.Свойство("ЮрФизЛицо",ЗначениеСвойства) Тогда
		Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо[ЗначениеСвойства];
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.ЮридическоеФизическоеЛицо) Тогда
		Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	КонецЕсли;
	
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ТекстПодсказки = "Фамилия Имя Отчество";
	Иначе
		
		ТекстПодсказки = "Название организации";		
	
	КонецЕсли; 
	Элементы.Наименование.ПодсказкаВвода = ТекстПодсказки;
	ЗаполнитьРеквизитыКО();	
КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	ПереключитьСтраницы();// Вставить содержимое обработчика.
КонецПроцедуры

Функция ПолучитьКлиентаФизЛица(ФизическоеЛицо)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка")[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли; 

КонецФункции //


&НаКлиенте
Процедура ВыбратьФизЛицо(Команда)
	//ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораФизЛица",ЭтаФорма);
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	КлиентФизЛица = ПолучитьКлиентаФизЛица(ВыбранноеЗначение);
	Если НЕ КлиентФизЛица = Объект.Ссылка И НЕ КлиентФизЛица = Неопределено Тогда
	
		ПоказатьПредупреждение(,"Физическое лицо уже соответствует дургому клиенту");	
		Возврат;
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//Запишем значения контактной информации в регистр сведений
	КонтактнаяИнформация = РегистрыСведений.КонтактнаяИнформация;
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		ВладелецКО = Объект.Ссылка;
		НаборЗаписей = КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Владелец.Установить(ВладелецКО);
		НаборЗаписей.Прочитать();
		
		Если НЕ НаборЗаписей.Количество() = 0 Тогда; 
			НоваяЗапись = НаборЗаписей[0];
		Иначе
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Владелец = ВладелецКО;
		КонецЕсли;
		Если НЕ НоваяЗапись.НомерСохраненный = Телефон 
			ИЛИ НЕ НоваяЗапись.ЭлектроннаяПочта = ЭлектроннаяПочта Тогда
			НоваяЗапись.НомерПриведенный = РаботаСКонтактнойИнформациейКлиентСервер.ПриведенныйНомерТелефона(Телефон);
			НоваяЗапись.НомерСохраненный = Телефон;
			НоваяЗапись.ЭлектроннаяПочта = ЭлектроннаяПочта;
			НаборЗаписей.Записать(Истина);
		КонецЕсли; 
	Иначе
		//Обработка не требуется
		//контактная информация записывается при записи элемента физическое лицо
	КонецЕсли;
КонецПроцедуры
